#+LINK: tf http://tensorflow.org/
#+LINK: ed http://edwardlib.org

https://orgmode.org/worg/exporters/beamer/tutorial.html
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+BEAMER_FRAME_LEVEL: 2
https://orgmode.org/manual/Export-settings.html#Export-settings
#+OPTIONS: broken-links:t

#+LATEX_HEADER: \usepackage{/home/arno/Dropbox/spacemacs/private/nandu/stylelib/beamerthemelankton-keynote}

*** NOTE:
    The $\tau$ prior is unchanging anyway, that's why the results are all the same, i.e. if $\tau$ is ``full`` estimated, its prior is always
    $$
    \tau \sim \Gamma(\tau; 1 \times 10^{-5}, 1 \times 10^{-5}).
    $$
  
  
    I make the default configuration for the priors over $\mu$ and $\tau$ now Bayesian and trainable:

    #+begin_src ipython :results raw :session
  p2o.table(core.probPCA.configure())
    #+end_src

    #+RESULTS:
    |           |     |       | trainable | initializer               |
    |-----------+-----+-------+-----------+---------------------------|
    | posterior | W   | loc   | True      | random_normal_initializer |
    |           |     | scale | True      | random_normal_initializer |
    |           | Z   | loc   | True      | random_normal_initializer |
    |           |     | scale | True      | random_normal_initializer |
    |           | mu  | loc   | True      | data_mean                 |
    |           |     | scale | True      | random_normal_initializer |
    |           | tau | loc   | True      | random_normal_initializer |
    |           |     | scale | True      | random_normal_initializer |
    | prior     | W   | loc   | False     | zeros_initializer         |
    |           |     | scale | False     | ones_initializer          |
    |           | Z   | loc   | False     | zeros_initializer         |
    |           |     | scale | False     | ones_initializer          |
    |           | mu  | loc   | True      | data_mean                 |
    |           |     | scale | True      | random_normal_initializer |
    |           | tau | loc   | False     | zeros_initializer         |
    |           |     | scale | False     | ones_initializer          |



#+begin_src ipython :results  :session
t = tests.Test('../python/pca/experiments.h5', 'covariance', plot=True)
#+end_src

#+begin_src ipython :results  :session
r[r.convergence_test=='data_loss']
#+end_src

#+begin_src ipython :results  :session
axs = test.plot('seed', {'covariance': ['none', 'full']}, results=r[r.convergence_test=='data_loss'])
axs[0, 3].legend(loc='upper left', bbox_to_anchor=(1, 1));
#+end_src

#+begin_src ipython :results  :session
d.missing(.3)
#+end_src


